Coding/Cpp/hdu2.1.8.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hdu2.1.8</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="hdu2.1.8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 22:31:58 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">hdu2.1.8</h1>


<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 基本思路</a></li>
<li><a href="#sec-2">2 hdu 2.1.8 源码</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本思路</h2>
<div class="outline-text-2" id="text-1">

<p>  将循环小数化为分数的思想：
  0.3333……循环先把它*10再相减再/9即可得到1/3。
  0.32(692307)先把它*100，得32.(692307)再*10<sup>6</sup> 后减去32.(692307)再/(10<sup>6</sup>-1)。
  思想就是这样。
  第一次自己没有看网上参考答案做下来的，虽是水题但还是挺激动的，写个解题报告记录下记录下吧:)
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> hdu 2.1.8 源码</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-c++"><span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;string&gt;</span>
<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;cmath&gt;</span>
<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;cstdlib&gt;</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">gcd</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span>)
{
        <span style="color: #a020f0;">if</span>(b == 0) <span style="color: #a020f0;">return</span> a;
        <span style="color: #a020f0;">return</span> gcd(b, a%b );
}
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">n</span>, <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>, <span style="color: #a0522d;">k</span>;         <span style="color: #b22222;">// </span><span style="color: #b22222;">i &#34920;&#65288;&#20301;&#32622; j&#34920;&#65289;&#20301;&#32622; k&#34920;&#24490;&#29615;&#37096;&#20998;&#20301;&#25968;</span>
        <span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">x</span>, <span style="color: #a0522d;">y</span>, <span style="color: #a0522d;">g</span>;      <span style="color: #b22222;">// </span><span style="color: #b22222;">x&#20570;&#20026;&#20998;&#23376; y&#20570;&#20998;&#27597; g&#34920;&#31034;xy&#30340;&#26368;&#22823;&#20844;&#32422;&#25968;</span>
        <span style="color: #228b22;">string</span> <span style="color: #a0522d;">str</span>;
        <span style="color: #a020f0;">while</span>(cin&gt;&gt;n){
                <span style="color: #a020f0;">while</span>(n--){
                        cin&gt;&gt;str;
                        <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20998;&#20026;&#26377;&#24490;&#29615;&#37096;&#20998;&#21644;&#26080;&#24490;&#29615;&#37096;&#20998;</span>
                        <span style="color: #a020f0;">if</span>(str.find(<span style="color: #8b2252;">"("</span>) != <span style="color: #008b8b;">string</span>::npos){
                                i = str.find(<span style="color: #8b2252;">"("</span>);
                                j = str.find(<span style="color: #8b2252;">")"</span>);
                                k = j - i - 1;
                                <span style="color: #a020f0;">if</span>(i == 2){ <span style="color: #b22222;">// </span><span style="color: #b22222;">&#26377;&#24490;&#29615;&#37096;&#20998;&#21448;&#20998;&#20026;&#24490;&#29615;&#37096;&#20998;&#21069;&#38754;&#26377;&#27809;&#26377;&#25968;&#23383;</span>
                                        x = atoi(str.substr(i+1, j).c_str());
                                        y = pow((<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)10, (<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)k)-1;
                                        g = gcd(x, y);
                                }<span style="color: #a020f0;">else</span>{
                                        x = atoi(str.substr(2, i).c_str());
                                        y = atoi(str.substr(i+1, j).c_str());
                                        x = pow((<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)10, (<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)k)*x + y - x;
                                        y = pow((<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)10, (<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)(i-2))*(pow((<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)10, (<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)k)-1);
                                        g = gcd(x, y);
                                }
                        }<span style="color: #a020f0;">else</span>{
                                str = str.substr(2);
                                k = str.length();
                                x = atoi(str.c_str());
                                y = pow((<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)10, (<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span>)k);
                                g = gcd(x, y);
                        }
                        cout&lt;&lt;x/g&lt;&lt;<span style="color: #8b2252;">"/"</span>&lt;&lt;y/g&lt;&lt;endl;
                }

        }
        <span style="color: #a020f0;">return</span> 0;
}
</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

</body>
</html>
